# Apply Function

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(
    {
        "Col1" : np.array([1,2,3,4,5]),
        "Col2" : np.array([10,20,30,40,50])
    }
)
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

# syntax:
    - df_name.apply(function)

In [4]:
df.apply(np.sqrt)

       Col1      Col2
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226
3  2.000000  6.324555
4  2.236068  7.071068

In [5]:
df.apply(np.square)

   Col1  Col2
0     1   100
1     4   400
2     9   900
3    16  1600
4    25  2500

In [6]:
x = lambda x : x + 500
x(1)

501

In [7]:
df.apply(lambda x : x + 500)

   Col1  Col2
0   501   510
1   502   520
2   503   530
3   504   540
4   505   550

In [8]:
df.apply(lambda x : x * 2)

   Col1  Col2
0     2    20
1     4    40
2     6    60
3     8    80
4    10   100

In [10]:
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [11]:
ndf = df.apply(lambda x : x % 2)
ndf

   Col1  Col2
0     1     0
1     0     0
2     1     0
3     0     0
4     1     0

In [12]:
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [18]:
def Dummy(value):
    return "Learning apply function"
ndf1 = df.apply(Dummy)
ndf1

Col1    Learning apply function
Col2    Learning apply function
dtype: object

In [15]:
def Dummy(value):
    return value + value 
ndf1 = df.apply(Dummy)

In [16]:
ndf1

   Col1  Col2
0     2    20
1     4    40
2     6    60
3     8    80
4    10   100

In [21]:
def Upper(n):
    return n.upper()

In [23]:
ndf1[['Col1']].apply(Upper)

Col1    LEARNING APPLY FUNCTION
dtype: object

In [25]:
def Dummy(value):
    return value + value 
ndf1 = df.apply(Dummy)
ndf1

   Col1  Col2
0     2    20
1     4    40
2     6    60
3     8    80
4    10   100

In [27]:
type(ndf1['Col1'])

pandas.core.series.Series

In [28]:
type(ndf1[['Col1']])

pandas.core.frame.DataFrame

In [26]:
ndf1[["Col1"]] = ndf1[["Col1"]].apply(lambda x : x + 100)
ndf1

   Col1  Col2
0   102    20
1   104    40
2   106    60
3   108    80
4   110   100

In [29]:
def Dummy(value):
    return "DS"

In [31]:
df["Col1"].apply(Dummy)

0    DS
1    DS
2    DS
3    DS
4    DS
Name: Col1, dtype: object

In [32]:
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [33]:
df['Col1'].apply(lambda x : "Python")

0    Python
1    Python
2    Python
3    Python
4    Python
Name: Col1, dtype: object

In [34]:
df[['Col1']].apply(lambda x : "Python")

Col1    Python
dtype: object

In [35]:
df.apply(lambda x : "Python")

Col1    Python
Col2    Python
dtype: object

In [36]:
df = pd.DataFrame(
    {
        "Country":["India","UK","USA"],
        "Capital":["Delhi","London","Washington DF"]
    }
)
df

  Country        Capital
0   India          Delhi
1      UK         London
2     USA  Washington DF

In [37]:
df['Country'].apply(lambda str1 : str1.lower())

0    india
1       uk
2      usa
Name: Country, dtype: object

In [38]:
df['Country'].apply(lambda str1 : str1.title())

0    India
1       Uk
2      Usa
Name: Country, dtype: object

In [39]:
df = pd.DataFrame(
    {
        "Country":["India","UK","USA"],
        "Capital":["Delhi","London","Washington DF"]
    }
)
df

  Country        Capital
0   India          Delhi
1      UK         London
2     USA  Washington DF

In [40]:
df['Country'] = df['Country'].apply(lambda ele : ele.upper())
df['Capital'] = df['Capital'].apply(lambda ele : ele.upper())
df

  Country        Capital
0   INDIA          DELHI
1      UK         LONDON
2     USA  WASHINGTON DF

In [42]:
df = pd.DataFrame(
    {
        "Country":["India@#@%%^","UK#$@@","USA%$%"],
        "Capital":["Delhi#@#$","London#$$%","Washington$%^ DF&%&"]
    }
)
df

       Country              Capital
0  India@#@%%^            Delhi#@#$
1       UK#$@@           London#$$%
2       USA%$%  Washington$%^ DF&%&

In [43]:
import string

In [44]:
string.ascii_lowercase

'abcdefghijklmnopqrstuvwxyz'

In [45]:
string.ascii_uppercase

'ABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [47]:
letters = string.ascii_letters
letters

'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [48]:
def Clean(str1):
    clean_str = ""
    for i in str1:
        if i in letters:
            clean_str += i
    return clean_str

In [49]:
Clean("Washington$%^ DF&%&")

'WashingtonDF'

In [50]:
letters = string.ascii_letters + " "
letters

'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ '

In [52]:
Clean("Washington$%^ DF&%&1234134534")

'Washington DF'

In [53]:
df

       Country              Capital
0  India@#@%%^            Delhi#@#$
1       UK#$@@           London#$$%
2       USA%$%  Washington$%^ DF&%&

In [54]:
df['Country'] = df["Country"].apply(Clean)
df

  Country              Capital
0   India            Delhi#@#$
1      UK           London#$$%
2     USA  Washington$%^ DF&%&

In [55]:
df['Capital'] = df["Capital"].apply(Clean)
df

  Country        Capital
0   India          Delhi
1      UK         London
2     USA  Washington DF

In [56]:
df = pd.DataFrame(
    {
        "Country":["India","UK","USA"],
        "Capital":["Delhi","London","Washington DF"]
    }
)
df

  Country        Capital
0   India          Delhi
1      UK         London
2     USA  Washington DF

In [57]:
df['Date'] = ["2021-01-12","2022-11-13","2022-06-15"]
df

  Country        Capital        Date
0   India          Delhi  2021-01-12
1      UK         London  2022-11-13
2     USA  Washington DF  2022-06-15

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  3 non-null      object
 1   Capital  3 non-null      object
 2   Date     3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [59]:
from datetime import datetime

In [62]:
datetime.strptime("2022-06-15", "%Y-%m-%d")

datetime.datetime(2022, 6, 15, 0, 0)

In [63]:
type(datetime.strptime("2022-06-15", "%Y-%m-%d"))

datetime.datetime

In [64]:
df['Date'] = df['Date'].apply(lambda date : datetime.strptime(date, "%Y-%m-%d"))
df

  Country        Capital       Date
0   India          Delhi 2021-01-12
1      UK         London 2022-11-13
2     USA  Washington DF 2022-06-15

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  3 non-null      object
 1   Capital  3 non-null      object
 2   Date     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes